vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/sdadc.h
/*
 * Component description for SDADC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-06-24T07:32:57Z  */
#ifndef _SAMC21_SDADC_COMPONENT_H_
#define _SAMC21_SDADC_COMPONENT_H_

#include "core_cm0plus.h"

/* ************************************************************************** */
/*                     SOFTWARE API DEFINITION FOR SDADC                      */
/* ************************************************************************** */

/* -------- SDADC_CTRLA : (SDADC Offset: 0x00) (R/W 8) Control A -------- */
#define SDADC_CTRLA_RESETVALUE                _UINT8_(0x00)                                        /*  (SDADC_CTRLA) Control A  Reset Value */

#define SDADC_CTRLA_SWRST_Pos                 _UINT8_(0)                                           /* (SDADC_CTRLA) Software Reset Position */
#define SDADC_CTRLA_SWRST_Msk                 (_UINT8_(0x1) << SDADC_CTRLA_SWRST_Pos)              /* (SDADC_CTRLA) Software Reset Mask */
#define SDADC_CTRLA_SWRST(value)              (SDADC_CTRLA_SWRST_Msk & (_UINT8_(value) << SDADC_CTRLA_SWRST_Pos)) /* Assignment of value for SWRST in the SDADC_CTRLA register */
#define SDADC_CTRLA_ENABLE_Pos                _UINT8_(1)                                           /* (SDADC_CTRLA) Enable Position */
#define SDADC_CTRLA_ENABLE_Msk                (_UINT8_(0x1) << SDADC_CTRLA_ENABLE_Pos)             /* (SDADC_CTRLA) Enable Mask */
#define SDADC_CTRLA_ENABLE(value)             (SDADC_CTRLA_ENABLE_Msk & (_UINT8_(value) << SDADC_CTRLA_ENABLE_Pos)) /* Assignment of value for ENABLE in the SDADC_CTRLA register */
#define SDADC_CTRLA_RUNSTDBY_Pos              _UINT8_(6)                                           /* (SDADC_CTRLA) Run during Standby Position */
#define SDADC_CTRLA_RUNSTDBY_Msk              (_UINT8_(0x1) << SDADC_CTRLA_RUNSTDBY_Pos)           /* (SDADC_CTRLA) Run during Standby Mask */
#define SDADC_CTRLA_RUNSTDBY(value)           (SDADC_CTRLA_RUNSTDBY_Msk & (_UINT8_(value) << SDADC_CTRLA_RUNSTDBY_Pos)) /* Assignment of value for RUNSTDBY in the SDADC_CTRLA register */
#define SDADC_CTRLA_ONDEMAND_Pos              _UINT8_(7)                                           /* (SDADC_CTRLA) On Demand Control Position */
#define SDADC_CTRLA_ONDEMAND_Msk              (_UINT8_(0x1) << SDADC_CTRLA_ONDEMAND_Pos)           /* (SDADC_CTRLA) On Demand Control Mask */
#define SDADC_CTRLA_ONDEMAND(value)           (SDADC_CTRLA_ONDEMAND_Msk & (_UINT8_(value) << SDADC_CTRLA_ONDEMAND_Pos)) /* Assignment of value for ONDEMAND in the SDADC_CTRLA register */
#define SDADC_CTRLA_Msk                       _UINT8_(0xC3)                                        /* (SDADC_CTRLA) Register Mask  */


/* -------- SDADC_REFCTRL : (SDADC Offset: 0x01) (R/W 8) Reference Control -------- */
#define SDADC_REFCTRL_RESETVALUE              _UINT8_(0x00)                                        /*  (SDADC_REFCTRL) Reference Control  Reset Value */

#define SDADC_REFCTRL_REFSEL_Pos              _UINT8_(0)                                           /* (SDADC_REFCTRL) Reference Selection Position */
#define SDADC_REFCTRL_REFSEL_Msk              (_UINT8_(0x3) << SDADC_REFCTRL_REFSEL_Pos)           /* (SDADC_REFCTRL) Reference Selection Mask */
#define SDADC_REFCTRL_REFSEL(value)           (SDADC_REFCTRL_REFSEL_Msk & (_UINT8_(value) << SDADC_REFCTRL_REFSEL_Pos)) /* Assignment of value for REFSEL in the SDADC_REFCTRL register */
#define   SDADC_REFCTRL_REFSEL_INTREF_Val     _UINT8_(0x0)                                         /* (SDADC_REFCTRL) Internal Bandgap Reference  */
#define   SDADC_REFCTRL_REFSEL_AREFB_Val      _UINT8_(0x1)                                         /* (SDADC_REFCTRL) External Reference  */
#define   SDADC_REFCTRL_REFSEL_DAC_Val        _UINT8_(0x2)                                         /* (SDADC_REFCTRL) Internal DAC Output  */
#define   SDADC_REFCTRL_REFSEL_INTVCC_Val     _UINT8_(0x3)                                         /* (SDADC_REFCTRL) VDDANA  */
#define SDADC_REFCTRL_REFSEL_INTREF           (SDADC_REFCTRL_REFSEL_INTREF_Val << SDADC_REFCTRL_REFSEL_Pos) /* (SDADC_REFCTRL) Internal Bandgap Reference Position */
#define SDADC_REFCTRL_REFSEL_AREFB            (SDADC_REFCTRL_REFSEL_AREFB_Val << SDADC_REFCTRL_REFSEL_Pos) /* (SDADC_REFCTRL) External Reference Position */
#define SDADC_REFCTRL_REFSEL_DAC              (SDADC_REFCTRL_REFSEL_DAC_Val << SDADC_REFCTRL_REFSEL_Pos) /* (SDADC_REFCTRL) Internal DAC Output Position */
#define SDADC_REFCTRL_REFSEL_INTVCC           (SDADC_REFCTRL_REFSEL_INTVCC_Val << SDADC_REFCTRL_REFSEL_Pos) /* (SDADC_REFCTRL) VDDANA Position */
#define SDADC_REFCTRL_REFRANGE_Pos            _UINT8_(4)                                           /* (SDADC_REFCTRL) Reference Range Position */
#define SDADC_REFCTRL_REFRANGE_Msk            (_UINT8_(0x3) << SDADC_REFCTRL_REFRANGE_Pos)         /* (SDADC_REFCTRL) Reference Range Mask */
#define SDADC_REFCTRL_REFRANGE(value)         (SDADC_REFCTRL_REFRANGE_Msk & (_UINT8_(value) << SDADC_REFCTRL_REFRANGE_Pos)) /* Assignment of value for REFRANGE in the SDADC_REFCTRL register */
#define SDADC_REFCTRL_ONREFBUF_Pos            _UINT8_(7)                                           /* (SDADC_REFCTRL) Reference Buffer Position */
#define SDADC_REFCTRL_ONREFBUF_Msk            (_UINT8_(0x1) << SDADC_REFCTRL_ONREFBUF_Pos)         /* (SDADC_REFCTRL) Reference Buffer Mask */
#define SDADC_REFCTRL_ONREFBUF(value)         (SDADC_REFCTRL_ONREFBUF_Msk & (_UINT8_(value) << SDADC_REFCTRL_ONREFBUF_Pos)) /* Assignment of value for ONREFBUF in the SDADC_REFCTRL register */
#define SDADC_REFCTRL_Msk                     _UINT8_(0xB3)                                        /* (SDADC_REFCTRL) Register Mask  */


/* -------- SDADC_CTRLB : (SDADC Offset: 0x02) (R/W 16) Control B -------- */
#define SDADC_CTRLB_RESETVALUE                _UINT16_(0x2000)                                     /*  (SDADC_CTRLB) Control B  Reset Value */

