vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/sdadc.h
#define SDADC_CTRLB_PRESCALER_Pos             _UINT16_(0)                                          /* (SDADC_CTRLB) Prescaler Configuration Position */
#define SDADC_CTRLB_PRESCALER_Msk             (_UINT16_(0xFF) << SDADC_CTRLB_PRESCALER_Pos)        /* (SDADC_CTRLB) Prescaler Configuration Mask */
#define SDADC_CTRLB_PRESCALER(value)          (SDADC_CTRLB_PRESCALER_Msk & (_UINT16_(value) << SDADC_CTRLB_PRESCALER_Pos)) /* Assignment of value for PRESCALER in the SDADC_CTRLB register */
#define   SDADC_CTRLB_PRESCALER_DIV2_Val      _UINT16_(0x0)                                        /* (SDADC_CTRLB) Peripheral clock divided by 2  */
#define   SDADC_CTRLB_PRESCALER_DIV4_Val      _UINT16_(0x1)                                        /* (SDADC_CTRLB) Peripheral clock divided by 4  */
#define   SDADC_CTRLB_PRESCALER_DIV8_Val      _UINT16_(0x2)                                        /* (SDADC_CTRLB) Peripheral clock divided by 8  */
#define   SDADC_CTRLB_PRESCALER_DIV16_Val     _UINT16_(0x3)                                        /* (SDADC_CTRLB) Peripheral clock divided by 16  */
#define   SDADC_CTRLB_PRESCALER_DIV32_Val     _UINT16_(0x4)                                        /* (SDADC_CTRLB) Peripheral clock divided by 32  */
#define   SDADC_CTRLB_PRESCALER_DIV64_Val     _UINT16_(0x5)                                        /* (SDADC_CTRLB) Peripheral clock divided by 64  */
#define   SDADC_CTRLB_PRESCALER_DIV128_Val    _UINT16_(0x6)                                        /* (SDADC_CTRLB) Peripheral clock divided by 128  */
#define   SDADC_CTRLB_PRESCALER_DIV256_Val    _UINT16_(0x7)                                        /* (SDADC_CTRLB) Peripheral clock divided by 256  */
#define SDADC_CTRLB_PRESCALER_DIV2            (SDADC_CTRLB_PRESCALER_DIV2_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 2 Position */
#define SDADC_CTRLB_PRESCALER_DIV4            (SDADC_CTRLB_PRESCALER_DIV4_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 4 Position */
#define SDADC_CTRLB_PRESCALER_DIV8            (SDADC_CTRLB_PRESCALER_DIV8_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 8 Position */
#define SDADC_CTRLB_PRESCALER_DIV16           (SDADC_CTRLB_PRESCALER_DIV16_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 16 Position */
#define SDADC_CTRLB_PRESCALER_DIV32           (SDADC_CTRLB_PRESCALER_DIV32_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 32 Position */
#define SDADC_CTRLB_PRESCALER_DIV64           (SDADC_CTRLB_PRESCALER_DIV64_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 64 Position */
#define SDADC_CTRLB_PRESCALER_DIV128          (SDADC_CTRLB_PRESCALER_DIV128_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 128 Position */
#define SDADC_CTRLB_PRESCALER_DIV256          (SDADC_CTRLB_PRESCALER_DIV256_Val << SDADC_CTRLB_PRESCALER_Pos) /* (SDADC_CTRLB) Peripheral clock divided by 256 Position */
#define SDADC_CTRLB_OSR_Pos                   _UINT16_(8)                                          /* (SDADC_CTRLB) Over Sampling Ratio Position */
#define SDADC_CTRLB_OSR_Msk                   (_UINT16_(0x7) << SDADC_CTRLB_OSR_Pos)               /* (SDADC_CTRLB) Over Sampling Ratio Mask */
#define SDADC_CTRLB_OSR(value)                (SDADC_CTRLB_OSR_Msk & (_UINT16_(value) << SDADC_CTRLB_OSR_Pos)) /* Assignment of value for OSR in the SDADC_CTRLB register */
#define   SDADC_CTRLB_OSR_OSR64_Val           _UINT16_(0x0)                                        /* (SDADC_CTRLB) Over Sampling Ratio is 64  */
#define   SDADC_CTRLB_OSR_OSR128_Val          _UINT16_(0x1)                                        /* (SDADC_CTRLB) Over Sampling Ratio is 128  */
#define   SDADC_CTRLB_OSR_OSR256_Val          _UINT16_(0x2)                                        /* (SDADC_CTRLB) Over Sampling Ratio is 256  */
#define   SDADC_CTRLB_OSR_OSR512_Val          _UINT16_(0x3)                                        /* (SDADC_CTRLB) Over Sampling Ratio is 512  */
#define   SDADC_CTRLB_OSR_OSR1024_Val         _UINT16_(0x4)                                        /* (SDADC_CTRLB) Over Sampling Ratio is 1024  */
#define SDADC_CTRLB_OSR_OSR64                 (SDADC_CTRLB_OSR_OSR64_Val << SDADC_CTRLB_OSR_Pos)   /* (SDADC_CTRLB) Over Sampling Ratio is 64 Position */
#define SDADC_CTRLB_OSR_OSR128                (SDADC_CTRLB_OSR_OSR128_Val << SDADC_CTRLB_OSR_Pos)  /* (SDADC_CTRLB) Over Sampling Ratio is 128 Position */
#define SDADC_CTRLB_OSR_OSR256                (SDADC_CTRLB_OSR_OSR256_Val << SDADC_CTRLB_OSR_Pos)  /* (SDADC_CTRLB) Over Sampling Ratio is 256 Position */
#define SDADC_CTRLB_OSR_OSR512                (SDADC_CTRLB_OSR_OSR512_Val << SDADC_CTRLB_OSR_Pos)  /* (SDADC_CTRLB) Over Sampling Ratio is 512 Position */
#define SDADC_CTRLB_OSR_OSR1024               (SDADC_CTRLB_OSR_OSR1024_Val << SDADC_CTRLB_OSR_Pos) /* (SDADC_CTRLB) Over Sampling Ratio is 1024 Position */
#define SDADC_CTRLB_SKPCNT_Pos                _UINT16_(12)                                         /* (SDADC_CTRLB) Skip Sample Count Position */
#define SDADC_CTRLB_SKPCNT_Msk                (_UINT16_(0xF) << SDADC_CTRLB_SKPCNT_Pos)            /* (SDADC_CTRLB) Skip Sample Count Mask */
#define SDADC_CTRLB_SKPCNT(value)             (SDADC_CTRLB_SKPCNT_Msk & (_UINT16_(value) << SDADC_CTRLB_SKPCNT_Pos)) /* Assignment of value for SKPCNT in the SDADC_CTRLB register */
#define SDADC_CTRLB_Msk                       _UINT16_(0xF7FF)                                     /* (SDADC_CTRLB) Register Mask  */


/* -------- SDADC_EVCTRL : (SDADC Offset: 0x04) (R/W 8) Event Control -------- */
#define SDADC_EVCTRL_RESETVALUE               _UINT8_(0x00)                                        /*  (SDADC_EVCTRL) Event Control  Reset Value */

#define SDADC_EVCTRL_FLUSHEI_Pos              _UINT8_(0)                                           /* (SDADC_EVCTRL) Flush Event Input Enable Position */
#define SDADC_EVCTRL_FLUSHEI_Msk              (_UINT8_(0x1) << SDADC_EVCTRL_FLUSHEI_Pos)           /* (SDADC_EVCTRL) Flush Event Input Enable Mask */
#define SDADC_EVCTRL_FLUSHEI(value)           (SDADC_EVCTRL_FLUSHEI_Msk & (_UINT8_(value) << SDADC_EVCTRL_FLUSHEI_Pos)) /* Assignment of value for FLUSHEI in the SDADC_EVCTRL register */
#define SDADC_EVCTRL_STARTEI_Pos              _UINT8_(1)                                           /* (SDADC_EVCTRL) Start Conversion Event Input Enable Position */
#define SDADC_EVCTRL_STARTEI_Msk              (_UINT8_(0x1) << SDADC_EVCTRL_STARTEI_Pos)           /* (SDADC_EVCTRL) Start Conversion Event Input Enable Mask */
#define SDADC_EVCTRL_STARTEI(value)           (SDADC_EVCTRL_STARTEI_Msk & (_UINT8_(value) << SDADC_EVCTRL_STARTEI_Pos)) /* Assignment of value for STARTEI in the SDADC_EVCTRL register */
#define SDADC_EVCTRL_FLUSHINV_Pos             _UINT8_(2)                                           /* (SDADC_EVCTRL) Flush Event Invert Enable Position */
#define SDADC_EVCTRL_FLUSHINV_Msk             (_UINT8_(0x1) << SDADC_EVCTRL_FLUSHINV_Pos)          /* (SDADC_EVCTRL) Flush Event Invert Enable Mask */
#define SDADC_EVCTRL_FLUSHINV(value)          (SDADC_EVCTRL_FLUSHINV_Msk & (_UINT8_(value) << SDADC_EVCTRL_FLUSHINV_Pos)) /* Assignment of value for FLUSHINV in the SDADC_EVCTRL register */
#define SDADC_EVCTRL_STARTINV_Pos             _UINT8_(3)                                           /* (SDADC_EVCTRL) Satrt Event Invert Enable Position */
#define SDADC_EVCTRL_STARTINV_Msk             (_UINT8_(0x1) << SDADC_EVCTRL_STARTINV_Pos)          /* (SDADC_EVCTRL) Satrt Event Invert Enable Mask */
#define SDADC_EVCTRL_STARTINV(value)          (SDADC_EVCTRL_STARTINV_Msk & (_UINT8_(value) << SDADC_EVCTRL_STARTINV_Pos)) /* Assignment of value for STARTINV in the SDADC_EVCTRL register */
#define SDADC_EVCTRL_RESRDYEO_Pos             _UINT8_(4)                                           /* (SDADC_EVCTRL) Result Ready Event Out Position */
#define SDADC_EVCTRL_RESRDYEO_Msk             (_UINT8_(0x1) << SDADC_EVCTRL_RESRDYEO_Pos)          /* (SDADC_EVCTRL) Result Ready Event Out Mask */
#define SDADC_EVCTRL_RESRDYEO(value)          (SDADC_EVCTRL_RESRDYEO_Msk & (_UINT8_(value) << SDADC_EVCTRL_RESRDYEO_Pos)) /* Assignment of value for RESRDYEO in the SDADC_EVCTRL register */
#define SDADC_EVCTRL_WINMONEO_Pos             _UINT8_(5)                                           /* (SDADC_EVCTRL) Window Monitor Event Out Position */
#define SDADC_EVCTRL_WINMONEO_Msk             (_UINT8_(0x1) << SDADC_EVCTRL_WINMONEO_Pos)          /* (SDADC_EVCTRL) Window Monitor Event Out Mask */
#define SDADC_EVCTRL_WINMONEO(value)          (SDADC_EVCTRL_WINMONEO_Msk & (_UINT8_(value) << SDADC_EVCTRL_WINMONEO_Pos)) /* Assignment of value for WINMONEO in the SDADC_EVCTRL register */
#define SDADC_EVCTRL_Msk                      _UINT8_(0x3F)                                        /* (SDADC_EVCTRL) Register Mask  */


/* -------- SDADC_INTENCLR : (SDADC Offset: 0x05) (R/W 8) Interrupt Enable Clear -------- */
#define SDADC_INTENCLR_RESETVALUE             _UINT8_(0x00)                                        /*  (SDADC_INTENCLR) Interrupt Enable Clear  Reset Value */

#define SDADC_INTENCLR_RESRDY_Pos             _UINT8_(0)                                           /* (SDADC_INTENCLR) Result Ready Interrupt Disable Position */
#define SDADC_INTENCLR_RESRDY_Msk             (_UINT8_(0x1) << SDADC_INTENCLR_RESRDY_Pos)          /* (SDADC_INTENCLR) Result Ready Interrupt Disable Mask */
#define SDADC_INTENCLR_RESRDY(value)          (SDADC_INTENCLR_RESRDY_Msk & (_UINT8_(value) << SDADC_INTENCLR_RESRDY_Pos)) /* Assignment of value for RESRDY in the SDADC_INTENCLR register */
#define SDADC_INTENCLR_OVERRUN_Pos            _UINT8_(1)                                           /* (SDADC_INTENCLR) Overrun Interrupt Disable Position */
#define SDADC_INTENCLR_OVERRUN_Msk            (_UINT8_(0x1) << SDADC_INTENCLR_OVERRUN_Pos)         /* (SDADC_INTENCLR) Overrun Interrupt Disable Mask */
#define SDADC_INTENCLR_OVERRUN(value)         (SDADC_INTENCLR_OVERRUN_Msk & (_UINT8_(value) << SDADC_INTENCLR_OVERRUN_Pos)) /* Assignment of value for OVERRUN in the SDADC_INTENCLR register */
#define SDADC_INTENCLR_WINMON_Pos             _UINT8_(2)                                           /* (SDADC_INTENCLR) Window Monitor Interrupt Disable Position */
#define SDADC_INTENCLR_WINMON_Msk             (_UINT8_(0x1) << SDADC_INTENCLR_WINMON_Pos)          /* (SDADC_INTENCLR) Window Monitor Interrupt Disable Mask */
#define SDADC_INTENCLR_WINMON(value)          (SDADC_INTENCLR_WINMON_Msk & (_UINT8_(value) << SDADC_INTENCLR_WINMON_Pos)) /* Assignment of value for WINMON in the SDADC_INTENCLR register */
#define SDADC_INTENCLR_Msk                    _UINT8_(0x07)                                        /* (SDADC_INTENCLR) Register Mask  */


/* -------- SDADC_INTENSET : (SDADC Offset: 0x06) (R/W 8) Interrupt Enable Set -------- */
#define SDADC_INTENSET_RESETVALUE             _UINT8_(0x00)                                        /*  (SDADC_INTENSET) Interrupt Enable Set  Reset Value */

#define SDADC_INTENSET_RESRDY_Pos             _UINT8_(0)                                           /* (SDADC_INTENSET) Result Ready Interrupt Enable Position */
#define SDADC_INTENSET_RESRDY_Msk             (_UINT8_(0x1) << SDADC_INTENSET_RESRDY_Pos)          /* (SDADC_INTENSET) Result Ready Interrupt Enable Mask */
#define SDADC_INTENSET_RESRDY(value)          (SDADC_INTENSET_RESRDY_Msk & (_UINT8_(value) << SDADC_INTENSET_RESRDY_Pos)) /* Assignment of value for RESRDY in the SDADC_INTENSET register */
#define SDADC_INTENSET_OVERRUN_Pos            _UINT8_(1)                                           /* (SDADC_INTENSET) Overrun Interrupt Enable Position */
#define SDADC_INTENSET_OVERRUN_Msk            (_UINT8_(0x1) << SDADC_INTENSET_OVERRUN_Pos)         /* (SDADC_INTENSET) Overrun Interrupt Enable Mask */
#define SDADC_INTENSET_OVERRUN(value)         (SDADC_INTENSET_OVERRUN_Msk & (_UINT8_(value) << SDADC_INTENSET_OVERRUN_Pos)) /* Assignment of value for OVERRUN in the SDADC_INTENSET register */
#define SDADC_INTENSET_WINMON_Pos             _UINT8_(2)                                           /* (SDADC_INTENSET) Window Monitor Interrupt Enable Position */
#define SDADC_INTENSET_WINMON_Msk             (_UINT8_(0x1) << SDADC_INTENSET_WINMON_Pos)          /* (SDADC_INTENSET) Window Monitor Interrupt Enable Mask */
#define SDADC_INTENSET_WINMON(value)          (SDADC_INTENSET_WINMON_Msk & (_UINT8_(value) << SDADC_INTENSET_WINMON_Pos)) /* Assignment of value for WINMON in the SDADC_INTENSET register */
#define SDADC_INTENSET_Msk                    _UINT8_(0x07)                                        /* (SDADC_INTENSET) Register Mask  */


/* -------- SDADC_INTFLAG : (SDADC Offset: 0x07) (R/W 8) Interrupt Flag Status and Clear -------- */
#define SDADC_INTFLAG_RESETVALUE              _UINT8_(0x00)                                        /*  (SDADC_INTFLAG) Interrupt Flag Status and Clear  Reset Value */

#define SDADC_INTFLAG_RESRDY_Pos              _UINT8_(0)                                           /* (SDADC_INTFLAG) Result Ready Interrupt Flag Position */
#define SDADC_INTFLAG_RESRDY_Msk              (_UINT8_(0x1) << SDADC_INTFLAG_RESRDY_Pos)           /* (SDADC_INTFLAG) Result Ready Interrupt Flag Mask */
#define SDADC_INTFLAG_RESRDY(value)           (SDADC_INTFLAG_RESRDY_Msk & (_UINT8_(value) << SDADC_INTFLAG_RESRDY_Pos)) /* Assignment of value for RESRDY in the SDADC_INTFLAG register */
#define SDADC_INTFLAG_OVERRUN_Pos             _UINT8_(1)                                           /* (SDADC_INTFLAG) Overrun Interrupt Flag Position */
#define SDADC_INTFLAG_OVERRUN_Msk             (_UINT8_(0x1) << SDADC_INTFLAG_OVERRUN_Pos)          /* (SDADC_INTFLAG) Overrun Interrupt Flag Mask */
#define SDADC_INTFLAG_OVERRUN(value)          (SDADC_INTFLAG_OVERRUN_Msk & (_UINT8_(value) << SDADC_INTFLAG_OVERRUN_Pos)) /* Assignment of value for OVERRUN in the SDADC_INTFLAG register */
#define SDADC_INTFLAG_WINMON_Pos              _UINT8_(2)                                           /* (SDADC_INTFLAG) Window Monitor Interrupt Flag Position */
#define SDADC_INTFLAG_WINMON_Msk              (_UINT8_(0x1) << SDADC_INTFLAG_WINMON_Pos)           /* (SDADC_INTFLAG) Window Monitor Interrupt Flag Mask */
#define SDADC_INTFLAG_WINMON(value)           (SDADC_INTFLAG_WINMON_Msk & (_UINT8_(value) << SDADC_INTFLAG_WINMON_Pos)) /* Assignment of value for WINMON in the SDADC_INTFLAG register */
#define SDADC_INTFLAG_Msk                     _UINT8_(0x07)                                        /* (SDADC_INTFLAG) Register Mask  */


