vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/sdadc.h
/* -------- SDADC_SEQSTATUS : (SDADC Offset: 0x08) ( R/ 8) Sequence Status -------- */
#define SDADC_SEQSTATUS_RESETVALUE            _UINT8_(0x00)                                        /*  (SDADC_SEQSTATUS) Sequence Status  Reset Value */

#define SDADC_SEQSTATUS_SEQSTATE_Pos          _UINT8_(0)                                           /* (SDADC_SEQSTATUS) Sequence State Position */
#define SDADC_SEQSTATUS_SEQSTATE_Msk          (_UINT8_(0xF) << SDADC_SEQSTATUS_SEQSTATE_Pos)       /* (SDADC_SEQSTATUS) Sequence State Mask */
#define SDADC_SEQSTATUS_SEQSTATE(value)       (SDADC_SEQSTATUS_SEQSTATE_Msk & (_UINT8_(value) << SDADC_SEQSTATUS_SEQSTATE_Pos)) /* Assignment of value for SEQSTATE in the SDADC_SEQSTATUS register */
#define SDADC_SEQSTATUS_SEQBUSY_Pos           _UINT8_(7)                                           /* (SDADC_SEQSTATUS) Sequence Busy Position */
#define SDADC_SEQSTATUS_SEQBUSY_Msk           (_UINT8_(0x1) << SDADC_SEQSTATUS_SEQBUSY_Pos)        /* (SDADC_SEQSTATUS) Sequence Busy Mask */
#define SDADC_SEQSTATUS_SEQBUSY(value)        (SDADC_SEQSTATUS_SEQBUSY_Msk & (_UINT8_(value) << SDADC_SEQSTATUS_SEQBUSY_Pos)) /* Assignment of value for SEQBUSY in the SDADC_SEQSTATUS register */
#define SDADC_SEQSTATUS_Msk                   _UINT8_(0x8F)                                        /* (SDADC_SEQSTATUS) Register Mask  */


/* -------- SDADC_INPUTCTRL : (SDADC Offset: 0x09) (R/W 8) Input Control -------- */
#define SDADC_INPUTCTRL_RESETVALUE            _UINT8_(0x00)                                        /*  (SDADC_INPUTCTRL) Input Control  Reset Value */

#define SDADC_INPUTCTRL_MUXSEL_Pos            _UINT8_(0)                                           /* (SDADC_INPUTCTRL) SDADC Input Selection Position */
#define SDADC_INPUTCTRL_MUXSEL_Msk            (_UINT8_(0xF) << SDADC_INPUTCTRL_MUXSEL_Pos)         /* (SDADC_INPUTCTRL) SDADC Input Selection Mask */
#define SDADC_INPUTCTRL_MUXSEL(value)         (SDADC_INPUTCTRL_MUXSEL_Msk & (_UINT8_(value) << SDADC_INPUTCTRL_MUXSEL_Pos)) /* Assignment of value for MUXSEL in the SDADC_INPUTCTRL register */
#define   SDADC_INPUTCTRL_MUXSEL_AIN0_Val     _UINT8_(0x0)                                         /* (SDADC_INPUTCTRL) SDADC AIN0 Pin  */
#define   SDADC_INPUTCTRL_MUXSEL_AIN1_Val     _UINT8_(0x1)                                         /* (SDADC_INPUTCTRL) SDADC AIN1 Pin  */
#define   SDADC_INPUTCTRL_MUXSEL_AIN2_Val     _UINT8_(0x2)                                         /* (SDADC_INPUTCTRL) SDADC AIN2 Pin  */
#define SDADC_INPUTCTRL_MUXSEL_AIN0           (SDADC_INPUTCTRL_MUXSEL_AIN0_Val << SDADC_INPUTCTRL_MUXSEL_Pos) /* (SDADC_INPUTCTRL) SDADC AIN0 Pin Position */
#define SDADC_INPUTCTRL_MUXSEL_AIN1           (SDADC_INPUTCTRL_MUXSEL_AIN1_Val << SDADC_INPUTCTRL_MUXSEL_Pos) /* (SDADC_INPUTCTRL) SDADC AIN1 Pin Position */
#define SDADC_INPUTCTRL_MUXSEL_AIN2           (SDADC_INPUTCTRL_MUXSEL_AIN2_Val << SDADC_INPUTCTRL_MUXSEL_Pos) /* (SDADC_INPUTCTRL) SDADC AIN2 Pin Position */
#define SDADC_INPUTCTRL_Msk                   _UINT8_(0x0F)                                        /* (SDADC_INPUTCTRL) Register Mask  */


/* -------- SDADC_CTRLC : (SDADC Offset: 0x0A) (R/W 8) Control C -------- */
#define SDADC_CTRLC_RESETVALUE                _UINT8_(0x00)                                        /*  (SDADC_CTRLC) Control C  Reset Value */

#define SDADC_CTRLC_FREERUN_Pos               _UINT8_(0)                                           /* (SDADC_CTRLC) Free Running Mode Position */
#define SDADC_CTRLC_FREERUN_Msk               (_UINT8_(0x1) << SDADC_CTRLC_FREERUN_Pos)            /* (SDADC_CTRLC) Free Running Mode Mask */
#define SDADC_CTRLC_FREERUN(value)            (SDADC_CTRLC_FREERUN_Msk & (_UINT8_(value) << SDADC_CTRLC_FREERUN_Pos)) /* Assignment of value for FREERUN in the SDADC_CTRLC register */
#define SDADC_CTRLC_Msk                       _UINT8_(0x01)                                        /* (SDADC_CTRLC) Register Mask  */


/* -------- SDADC_WINCTRL : (SDADC Offset: 0x0B) (R/W 8) Window Monitor Control -------- */
#define SDADC_WINCTRL_RESETVALUE              _UINT8_(0x00)                                        /*  (SDADC_WINCTRL) Window Monitor Control  Reset Value */

#define SDADC_WINCTRL_WINMODE_Pos             _UINT8_(0)                                           /* (SDADC_WINCTRL) Window Monitor Mode Position */
#define SDADC_WINCTRL_WINMODE_Msk             (_UINT8_(0x7) << SDADC_WINCTRL_WINMODE_Pos)          /* (SDADC_WINCTRL) Window Monitor Mode Mask */
#define SDADC_WINCTRL_WINMODE(value)          (SDADC_WINCTRL_WINMODE_Msk & (_UINT8_(value) << SDADC_WINCTRL_WINMODE_Pos)) /* Assignment of value for WINMODE in the SDADC_WINCTRL register */
#define SDADC_WINCTRL_Msk                     _UINT8_(0x07)                                        /* (SDADC_WINCTRL) Register Mask  */


/* -------- SDADC_WINLT : (SDADC Offset: 0x0C) (R/W 32) Window Monitor Lower Threshold -------- */
#define SDADC_WINLT_RESETVALUE                _UINT32_(0x00)                                       /*  (SDADC_WINLT) Window Monitor Lower Threshold  Reset Value */

#define SDADC_WINLT_WINLT_Pos                 _UINT32_(0)                                          /* (SDADC_WINLT) Window Lower Threshold Position */
#define SDADC_WINLT_WINLT_Msk                 (_UINT32_(0xFFFFFF) << SDADC_WINLT_WINLT_Pos)        /* (SDADC_WINLT) Window Lower Threshold Mask */
#define SDADC_WINLT_WINLT(value)              (SDADC_WINLT_WINLT_Msk & (_UINT32_(value) << SDADC_WINLT_WINLT_Pos)) /* Assignment of value for WINLT in the SDADC_WINLT register */
#define SDADC_WINLT_Msk                       _UINT32_(0x00FFFFFF)                                 /* (SDADC_WINLT) Register Mask  */


/* -------- SDADC_WINUT : (SDADC Offset: 0x10) (R/W 32) Window Monitor Upper Threshold -------- */
#define SDADC_WINUT_RESETVALUE                _UINT32_(0x00)                                       /*  (SDADC_WINUT) Window Monitor Upper Threshold  Reset Value */

#define SDADC_WINUT_WINUT_Pos                 _UINT32_(0)                                          /* (SDADC_WINUT) Window Upper Threshold Position */
#define SDADC_WINUT_WINUT_Msk                 (_UINT32_(0xFFFFFF) << SDADC_WINUT_WINUT_Pos)        /* (SDADC_WINUT) Window Upper Threshold Mask */
#define SDADC_WINUT_WINUT(value)              (SDADC_WINUT_WINUT_Msk & (_UINT32_(value) << SDADC_WINUT_WINUT_Pos)) /* Assignment of value for WINUT in the SDADC_WINUT register */
#define SDADC_WINUT_Msk                       _UINT32_(0x00FFFFFF)                                 /* (SDADC_WINUT) Register Mask  */


