vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/sdadc.h
/* -------- SDADC_OFFSETCORR : (SDADC Offset: 0x14) (R/W 32) Offset Correction -------- */
#define SDADC_OFFSETCORR_RESETVALUE           _UINT32_(0x00)                                       /*  (SDADC_OFFSETCORR) Offset Correction  Reset Value */

#define SDADC_OFFSETCORR_OFFSETCORR_Pos       _UINT32_(0)                                          /* (SDADC_OFFSETCORR) Offset Correction Value Position */
#define SDADC_OFFSETCORR_OFFSETCORR_Msk       (_UINT32_(0xFFFFFF) << SDADC_OFFSETCORR_OFFSETCORR_Pos) /* (SDADC_OFFSETCORR) Offset Correction Value Mask */
#define SDADC_OFFSETCORR_OFFSETCORR(value)    (SDADC_OFFSETCORR_OFFSETCORR_Msk & (_UINT32_(value) << SDADC_OFFSETCORR_OFFSETCORR_Pos)) /* Assignment of value for OFFSETCORR in the SDADC_OFFSETCORR register */
#define SDADC_OFFSETCORR_Msk                  _UINT32_(0x00FFFFFF)                                 /* (SDADC_OFFSETCORR) Register Mask  */


/* -------- SDADC_GAINCORR : (SDADC Offset: 0x18) (R/W 16) Gain Correction -------- */
#define SDADC_GAINCORR_RESETVALUE             _UINT16_(0x01)                                       /*  (SDADC_GAINCORR) Gain Correction  Reset Value */

#define SDADC_GAINCORR_GAINCORR_Pos           _UINT16_(0)                                          /* (SDADC_GAINCORR) Gain Correction Value Position */
#define SDADC_GAINCORR_GAINCORR_Msk           (_UINT16_(0x3FFF) << SDADC_GAINCORR_GAINCORR_Pos)    /* (SDADC_GAINCORR) Gain Correction Value Mask */
#define SDADC_GAINCORR_GAINCORR(value)        (SDADC_GAINCORR_GAINCORR_Msk & (_UINT16_(value) << SDADC_GAINCORR_GAINCORR_Pos)) /* Assignment of value for GAINCORR in the SDADC_GAINCORR register */
#define SDADC_GAINCORR_Msk                    _UINT16_(0x3FFF)                                     /* (SDADC_GAINCORR) Register Mask  */


/* -------- SDADC_SHIFTCORR : (SDADC Offset: 0x1A) (R/W 8) Shift Correction -------- */
#define SDADC_SHIFTCORR_RESETVALUE            _UINT8_(0x00)                                        /*  (SDADC_SHIFTCORR) Shift Correction  Reset Value */

#define SDADC_SHIFTCORR_SHIFTCORR_Pos         _UINT8_(0)                                           /* (SDADC_SHIFTCORR) Shift Correction Value Position */
#define SDADC_SHIFTCORR_SHIFTCORR_Msk         (_UINT8_(0xF) << SDADC_SHIFTCORR_SHIFTCORR_Pos)      /* (SDADC_SHIFTCORR) Shift Correction Value Mask */
#define SDADC_SHIFTCORR_SHIFTCORR(value)      (SDADC_SHIFTCORR_SHIFTCORR_Msk & (_UINT8_(value) << SDADC_SHIFTCORR_SHIFTCORR_Pos)) /* Assignment of value for SHIFTCORR in the SDADC_SHIFTCORR register */
#define SDADC_SHIFTCORR_Msk                   _UINT8_(0x0F)                                        /* (SDADC_SHIFTCORR) Register Mask  */


/* -------- SDADC_SWTRIG : (SDADC Offset: 0x1C) (R/W 8) Software Trigger -------- */
#define SDADC_SWTRIG_RESETVALUE               _UINT8_(0x00)                                        /*  (SDADC_SWTRIG) Software Trigger  Reset Value */

#define SDADC_SWTRIG_FLUSH_Pos                _UINT8_(0)                                           /* (SDADC_SWTRIG) SDADC Flush Position */
#define SDADC_SWTRIG_FLUSH_Msk                (_UINT8_(0x1) << SDADC_SWTRIG_FLUSH_Pos)             /* (SDADC_SWTRIG) SDADC Flush Mask */
#define SDADC_SWTRIG_FLUSH(value)             (SDADC_SWTRIG_FLUSH_Msk & (_UINT8_(value) << SDADC_SWTRIG_FLUSH_Pos)) /* Assignment of value for FLUSH in the SDADC_SWTRIG register */
#define SDADC_SWTRIG_START_Pos                _UINT8_(1)                                           /* (SDADC_SWTRIG) Start SDADC Conversion Position */
#define SDADC_SWTRIG_START_Msk                (_UINT8_(0x1) << SDADC_SWTRIG_START_Pos)             /* (SDADC_SWTRIG) Start SDADC Conversion Mask */
#define SDADC_SWTRIG_START(value)             (SDADC_SWTRIG_START_Msk & (_UINT8_(value) << SDADC_SWTRIG_START_Pos)) /* Assignment of value for START in the SDADC_SWTRIG register */
#define SDADC_SWTRIG_Msk                      _UINT8_(0x03)                                        /* (SDADC_SWTRIG) Register Mask  */


/* -------- SDADC_SYNCBUSY : (SDADC Offset: 0x20) ( R/ 32) Synchronization Busy -------- */
#define SDADC_SYNCBUSY_RESETVALUE             _UINT32_(0x00)                                       /*  (SDADC_SYNCBUSY) Synchronization Busy  Reset Value */

#define SDADC_SYNCBUSY_SWRST_Pos              _UINT32_(0)                                          /* (SDADC_SYNCBUSY) SWRST Synchronization Busy Position */
#define SDADC_SYNCBUSY_SWRST_Msk              (_UINT32_(0x1) << SDADC_SYNCBUSY_SWRST_Pos)          /* (SDADC_SYNCBUSY) SWRST Synchronization Busy Mask */
#define SDADC_SYNCBUSY_SWRST(value)           (SDADC_SYNCBUSY_SWRST_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_SWRST_Pos)) /* Assignment of value for SWRST in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_ENABLE_Pos             _UINT32_(1)                                          /* (SDADC_SYNCBUSY) ENABLE Synchronization Busy Position */
#define SDADC_SYNCBUSY_ENABLE_Msk             (_UINT32_(0x1) << SDADC_SYNCBUSY_ENABLE_Pos)         /* (SDADC_SYNCBUSY) ENABLE Synchronization Busy Mask */
#define SDADC_SYNCBUSY_ENABLE(value)          (SDADC_SYNCBUSY_ENABLE_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_ENABLE_Pos)) /* Assignment of value for ENABLE in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_CTRLC_Pos              _UINT32_(2)                                          /* (SDADC_SYNCBUSY) CTRLC Synchronization Busy Position */
#define SDADC_SYNCBUSY_CTRLC_Msk              (_UINT32_(0x1) << SDADC_SYNCBUSY_CTRLC_Pos)          /* (SDADC_SYNCBUSY) CTRLC Synchronization Busy Mask */
#define SDADC_SYNCBUSY_CTRLC(value)           (SDADC_SYNCBUSY_CTRLC_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_CTRLC_Pos)) /* Assignment of value for CTRLC in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_INPUTCTRL_Pos          _UINT32_(3)                                          /* (SDADC_SYNCBUSY) INPUTCTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_INPUTCTRL_Msk          (_UINT32_(0x1) << SDADC_SYNCBUSY_INPUTCTRL_Pos)      /* (SDADC_SYNCBUSY) INPUTCTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_INPUTCTRL(value)       (SDADC_SYNCBUSY_INPUTCTRL_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_INPUTCTRL_Pos)) /* Assignment of value for INPUTCTRL in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_WINCTRL_Pos            _UINT32_(4)                                          /* (SDADC_SYNCBUSY) WINCTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_WINCTRL_Msk            (_UINT32_(0x1) << SDADC_SYNCBUSY_WINCTRL_Pos)        /* (SDADC_SYNCBUSY) WINCTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_WINCTRL(value)         (SDADC_SYNCBUSY_WINCTRL_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_WINCTRL_Pos)) /* Assignment of value for WINCTRL in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_WINLT_Pos              _UINT32_(5)                                          /* (SDADC_SYNCBUSY) WINLT Synchronization Busy Position */
#define SDADC_SYNCBUSY_WINLT_Msk              (_UINT32_(0x1) << SDADC_SYNCBUSY_WINLT_Pos)          /* (SDADC_SYNCBUSY) WINLT Synchronization Busy Mask */
#define SDADC_SYNCBUSY_WINLT(value)           (SDADC_SYNCBUSY_WINLT_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_WINLT_Pos)) /* Assignment of value for WINLT in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_WINUT_Pos              _UINT32_(6)                                          /* (SDADC_SYNCBUSY) WINUT Synchronization Busy Position */
#define SDADC_SYNCBUSY_WINUT_Msk              (_UINT32_(0x1) << SDADC_SYNCBUSY_WINUT_Pos)          /* (SDADC_SYNCBUSY) WINUT Synchronization Busy Mask */
#define SDADC_SYNCBUSY_WINUT(value)           (SDADC_SYNCBUSY_WINUT_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_WINUT_Pos)) /* Assignment of value for WINUT in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_OFFSETCORR_Pos         _UINT32_(7)                                          /* (SDADC_SYNCBUSY) OFFSETCTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_OFFSETCORR_Msk         (_UINT32_(0x1) << SDADC_SYNCBUSY_OFFSETCORR_Pos)     /* (SDADC_SYNCBUSY) OFFSETCTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_OFFSETCORR(value)      (SDADC_SYNCBUSY_OFFSETCORR_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_OFFSETCORR_Pos)) /* Assignment of value for OFFSETCORR in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_GAINCORR_Pos           _UINT32_(8)                                          /* (SDADC_SYNCBUSY) GAINCORR Synchronization Busy Position */
#define SDADC_SYNCBUSY_GAINCORR_Msk           (_UINT32_(0x1) << SDADC_SYNCBUSY_GAINCORR_Pos)       /* (SDADC_SYNCBUSY) GAINCORR Synchronization Busy Mask */
#define SDADC_SYNCBUSY_GAINCORR(value)        (SDADC_SYNCBUSY_GAINCORR_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_GAINCORR_Pos)) /* Assignment of value for GAINCORR in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_SHIFTCORR_Pos          _UINT32_(9)                                          /* (SDADC_SYNCBUSY) SHIFTCORR Synchronization Busy Position */
#define SDADC_SYNCBUSY_SHIFTCORR_Msk          (_UINT32_(0x1) << SDADC_SYNCBUSY_SHIFTCORR_Pos)      /* (SDADC_SYNCBUSY) SHIFTCORR Synchronization Busy Mask */
#define SDADC_SYNCBUSY_SHIFTCORR(value)       (SDADC_SYNCBUSY_SHIFTCORR_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_SHIFTCORR_Pos)) /* Assignment of value for SHIFTCORR in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_SWTRIG_Pos             _UINT32_(10)                                         /* (SDADC_SYNCBUSY) SWTRG Synchronization Busy Position */
#define SDADC_SYNCBUSY_SWTRIG_Msk             (_UINT32_(0x1) << SDADC_SYNCBUSY_SWTRIG_Pos)         /* (SDADC_SYNCBUSY) SWTRG Synchronization Busy Mask */
#define SDADC_SYNCBUSY_SWTRIG(value)          (SDADC_SYNCBUSY_SWTRIG_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_SWTRIG_Pos)) /* Assignment of value for SWTRIG in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_ANACTRL_Pos            _UINT32_(11)                                         /* (SDADC_SYNCBUSY) ANACTRL Synchronization Busy Position */
#define SDADC_SYNCBUSY_ANACTRL_Msk            (_UINT32_(0x1) << SDADC_SYNCBUSY_ANACTRL_Pos)        /* (SDADC_SYNCBUSY) ANACTRL Synchronization Busy Mask */
#define SDADC_SYNCBUSY_ANACTRL(value)         (SDADC_SYNCBUSY_ANACTRL_Msk & (_UINT32_(value) << SDADC_SYNCBUSY_ANACTRL_Pos)) /* Assignment of value for ANACTRL in the SDADC_SYNCBUSY register */
#define SDADC_SYNCBUSY_Msk                    _UINT32_(0x00000FFF)                                 /* (SDADC_SYNCBUSY) Register Mask  */


/* -------- SDADC_RESULT : (SDADC Offset: 0x24) ( R/ 32) Result -------- */
#define SDADC_RESULT_RESETVALUE               _UINT32_(0x00)                                       /*  (SDADC_RESULT) Result  Reset Value */

#define SDADC_RESULT_RESULT_Pos               _UINT32_(0)                                          /* (SDADC_RESULT) Result Value Position */
#define SDADC_RESULT_RESULT_Msk               (_UINT32_(0xFFFFFF) << SDADC_RESULT_RESULT_Pos)      /* (SDADC_RESULT) Result Value Mask */
#define SDADC_RESULT_RESULT(value)            (SDADC_RESULT_RESULT_Msk & (_UINT32_(value) << SDADC_RESULT_RESULT_Pos)) /* Assignment of value for RESULT in the SDADC_RESULT register */
#define SDADC_RESULT_RESERVED_Pos             _UINT32_(24)                                         /* (SDADC_RESULT) Reserved Position */
#define SDADC_RESULT_RESERVED_Msk             (_UINT32_(0xFF) << SDADC_RESULT_RESERVED_Pos)        /* (SDADC_RESULT) Reserved Mask */
#define SDADC_RESULT_RESERVED(value)          (SDADC_RESULT_RESERVED_Msk & (_UINT32_(value) << SDADC_RESULT_RESERVED_Pos)) /* Assignment of value for RESERVED in the SDADC_RESULT register */
#define SDADC_RESULT_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (SDADC_RESULT) Register Mask  */


/* -------- SDADC_SEQCTRL : (SDADC Offset: 0x28) (R/W 8) Sequence Control -------- */
#define SDADC_SEQCTRL_RESETVALUE              _UINT8_(0x00)                                        /*  (SDADC_SEQCTRL) Sequence Control  Reset Value */

#define SDADC_SEQCTRL_SEQEN_Pos               _UINT8_(0)                                           /* (SDADC_SEQCTRL) Enable Positive Input in the Sequence Position */
#define SDADC_SEQCTRL_SEQEN_Msk               (_UINT8_(0x7) << SDADC_SEQCTRL_SEQEN_Pos)            /* (SDADC_SEQCTRL) Enable Positive Input in the Sequence Mask */
#define SDADC_SEQCTRL_SEQEN(value)            (SDADC_SEQCTRL_SEQEN_Msk & (_UINT8_(value) << SDADC_SEQCTRL_SEQEN_Pos)) /* Assignment of value for SEQEN in the SDADC_SEQCTRL register */
#define SDADC_SEQCTRL_Msk                     _UINT8_(0x07)                                        /* (SDADC_SEQCTRL) Register Mask  */


/* -------- SDADC_ANACTRL : (SDADC Offset: 0x2C) (R/W 8) Analog Control -------- */
#define SDADC_ANACTRL_RESETVALUE              _UINT8_(0x00)                                        /*  (SDADC_ANACTRL) Analog Control  Reset Value */

