vortexntnu/vortex-auv-embedded/bms/bms/bms_config_e18a/src/packs/ATSAMC21E18A_DFP/component/sdadc.h
#define SDADC_ANACTRL_CTRSDADC_Pos            _UINT8_(0)                                           /* (SDADC_ANACTRL) SDADC Control Position */
#define SDADC_ANACTRL_CTRSDADC_Msk            (_UINT8_(0x3F) << SDADC_ANACTRL_CTRSDADC_Pos)        /* (SDADC_ANACTRL) SDADC Control Mask */
#define SDADC_ANACTRL_CTRSDADC(value)         (SDADC_ANACTRL_CTRSDADC_Msk & (_UINT8_(value) << SDADC_ANACTRL_CTRSDADC_Pos)) /* Assignment of value for CTRSDADC in the SDADC_ANACTRL register */
#define SDADC_ANACTRL_ONCHOP_Pos              _UINT8_(6)                                           /* (SDADC_ANACTRL) Chopper Position */
#define SDADC_ANACTRL_ONCHOP_Msk              (_UINT8_(0x1) << SDADC_ANACTRL_ONCHOP_Pos)           /* (SDADC_ANACTRL) Chopper Mask */
#define SDADC_ANACTRL_ONCHOP(value)           (SDADC_ANACTRL_ONCHOP_Msk & (_UINT8_(value) << SDADC_ANACTRL_ONCHOP_Pos)) /* Assignment of value for ONCHOP in the SDADC_ANACTRL register */
#define SDADC_ANACTRL_BUFTEST_Pos             _UINT8_(7)                                           /* (SDADC_ANACTRL) BUFTEST Position */
#define SDADC_ANACTRL_BUFTEST_Msk             (_UINT8_(0x1) << SDADC_ANACTRL_BUFTEST_Pos)          /* (SDADC_ANACTRL) BUFTEST Mask */
#define SDADC_ANACTRL_BUFTEST(value)          (SDADC_ANACTRL_BUFTEST_Msk & (_UINT8_(value) << SDADC_ANACTRL_BUFTEST_Pos)) /* Assignment of value for BUFTEST in the SDADC_ANACTRL register */
#define SDADC_ANACTRL_Msk                     _UINT8_(0xFF)                                        /* (SDADC_ANACTRL) Register Mask  */


/* -------- SDADC_DBGCTRL : (SDADC Offset: 0x2E) (R/W 8) Debug Control -------- */
#define SDADC_DBGCTRL_RESETVALUE              _UINT8_(0x00)                                        /*  (SDADC_DBGCTRL) Debug Control  Reset Value */

#define SDADC_DBGCTRL_DBGRUN_Pos              _UINT8_(0)                                           /* (SDADC_DBGCTRL) Debug Run Position */
#define SDADC_DBGCTRL_DBGRUN_Msk              (_UINT8_(0x1) << SDADC_DBGCTRL_DBGRUN_Pos)           /* (SDADC_DBGCTRL) Debug Run Mask */
#define SDADC_DBGCTRL_DBGRUN(value)           (SDADC_DBGCTRL_DBGRUN_Msk & (_UINT8_(value) << SDADC_DBGCTRL_DBGRUN_Pos)) /* Assignment of value for DBGRUN in the SDADC_DBGCTRL register */
#define SDADC_DBGCTRL_Msk                     _UINT8_(0x01)                                        /* (SDADC_DBGCTRL) Register Mask  */


/* SDADC register offsets definitions */
#define SDADC_CTRLA_REG_OFST           _UINT32_(0x00)      /* (SDADC_CTRLA) Control A Offset */
#define SDADC_REFCTRL_REG_OFST         _UINT32_(0x01)      /* (SDADC_REFCTRL) Reference Control Offset */
#define SDADC_CTRLB_REG_OFST           _UINT32_(0x02)      /* (SDADC_CTRLB) Control B Offset */
#define SDADC_EVCTRL_REG_OFST          _UINT32_(0x04)      /* (SDADC_EVCTRL) Event Control Offset */
#define SDADC_INTENCLR_REG_OFST        _UINT32_(0x05)      /* (SDADC_INTENCLR) Interrupt Enable Clear Offset */
#define SDADC_INTENSET_REG_OFST        _UINT32_(0x06)      /* (SDADC_INTENSET) Interrupt Enable Set Offset */
#define SDADC_INTFLAG_REG_OFST         _UINT32_(0x07)      /* (SDADC_INTFLAG) Interrupt Flag Status and Clear Offset */
#define SDADC_SEQSTATUS_REG_OFST       _UINT32_(0x08)      /* (SDADC_SEQSTATUS) Sequence Status Offset */
#define SDADC_INPUTCTRL_REG_OFST       _UINT32_(0x09)      /* (SDADC_INPUTCTRL) Input Control Offset */
#define SDADC_CTRLC_REG_OFST           _UINT32_(0x0A)      /* (SDADC_CTRLC) Control C Offset */
#define SDADC_WINCTRL_REG_OFST         _UINT32_(0x0B)      /* (SDADC_WINCTRL) Window Monitor Control Offset */
#define SDADC_WINLT_REG_OFST           _UINT32_(0x0C)      /* (SDADC_WINLT) Window Monitor Lower Threshold Offset */
#define SDADC_WINUT_REG_OFST           _UINT32_(0x10)      /* (SDADC_WINUT) Window Monitor Upper Threshold Offset */
#define SDADC_OFFSETCORR_REG_OFST      _UINT32_(0x14)      /* (SDADC_OFFSETCORR) Offset Correction Offset */
#define SDADC_GAINCORR_REG_OFST        _UINT32_(0x18)      /* (SDADC_GAINCORR) Gain Correction Offset */
#define SDADC_SHIFTCORR_REG_OFST       _UINT32_(0x1A)      /* (SDADC_SHIFTCORR) Shift Correction Offset */
#define SDADC_SWTRIG_REG_OFST          _UINT32_(0x1C)      /* (SDADC_SWTRIG) Software Trigger Offset */
#define SDADC_SYNCBUSY_REG_OFST        _UINT32_(0x20)      /* (SDADC_SYNCBUSY) Synchronization Busy Offset */
#define SDADC_RESULT_REG_OFST          _UINT32_(0x24)      /* (SDADC_RESULT) Result Offset */
#define SDADC_SEQCTRL_REG_OFST         _UINT32_(0x28)      /* (SDADC_SEQCTRL) Sequence Control Offset */
#define SDADC_ANACTRL_REG_OFST         _UINT32_(0x2C)      /* (SDADC_ANACTRL) Analog Control Offset */
#define SDADC_DBGCTRL_REG_OFST         _UINT32_(0x2E)      /* (SDADC_DBGCTRL) Debug Control Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* SDADC register API structure */
typedef struct
{  /* Sigma-Delta Analog Digital Converter */
  __IO  uint8_t                        SDADC_CTRLA;        /* Offset: 0x00 (R/W  8) Control A */
  __IO  uint8_t                        SDADC_REFCTRL;      /* Offset: 0x01 (R/W  8) Reference Control */
  __IO  uint16_t                       SDADC_CTRLB;        /* Offset: 0x02 (R/W  16) Control B */
  __IO  uint8_t                        SDADC_EVCTRL;       /* Offset: 0x04 (R/W  8) Event Control */
  __IO  uint8_t                        SDADC_INTENCLR;     /* Offset: 0x05 (R/W  8) Interrupt Enable Clear */
  __IO  uint8_t                        SDADC_INTENSET;     /* Offset: 0x06 (R/W  8) Interrupt Enable Set */
  __IO  uint8_t                        SDADC_INTFLAG;      /* Offset: 0x07 (R/W  8) Interrupt Flag Status and Clear */
  __I   uint8_t                        SDADC_SEQSTATUS;    /* Offset: 0x08 (R/   8) Sequence Status */
  __IO  uint8_t                        SDADC_INPUTCTRL;    /* Offset: 0x09 (R/W  8) Input Control */
  __IO  uint8_t                        SDADC_CTRLC;        /* Offset: 0x0A (R/W  8) Control C */
  __IO  uint8_t                        SDADC_WINCTRL;      /* Offset: 0x0B (R/W  8) Window Monitor Control */
  __IO  uint32_t                       SDADC_WINLT;        /* Offset: 0x0C (R/W  32) Window Monitor Lower Threshold */
  __IO  uint32_t                       SDADC_WINUT;        /* Offset: 0x10 (R/W  32) Window Monitor Upper Threshold */
  __IO  uint32_t                       SDADC_OFFSETCORR;   /* Offset: 0x14 (R/W  32) Offset Correction */
  __IO  uint16_t                       SDADC_GAINCORR;     /* Offset: 0x18 (R/W  16) Gain Correction */
  __IO  uint8_t                        SDADC_SHIFTCORR;    /* Offset: 0x1A (R/W  8) Shift Correction */
  __I   uint8_t                        Reserved1[0x01];
  __IO  uint8_t                        SDADC_SWTRIG;       /* Offset: 0x1C (R/W  8) Software Trigger */
  __I   uint8_t                        Reserved2[0x03];
  __I   uint32_t                       SDADC_SYNCBUSY;     /* Offset: 0x20 (R/   32) Synchronization Busy */
  __I   uint32_t                       SDADC_RESULT;       /* Offset: 0x24 (R/   32) Result */
  __IO  uint8_t                        SDADC_SEQCTRL;      /* Offset: 0x28 (R/W  8) Sequence Control */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint8_t                        SDADC_ANACTRL;      /* Offset: 0x2C (R/W  8) Analog Control */
  __I   uint8_t                        Reserved4[0x01];
  __IO  uint8_t                        SDADC_DBGCTRL;      /* Offset: 0x2E (R/W  8) Debug Control */
} sdadc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMC21_SDADC_COMPONENT_H_ */
